# Gruppierung

### Folie 1 Pandas Seite 57

In [1]:
import pandas as pd
%xmode minimal
pd.set_option("mode.copy_on_write", True)

Exception reporting mode: Minimal

### Titanic Daten

In [2]:
url = 'https://hbiostat.org/data/repo/titanic5.xlsx '

In [17]:
t = pd.read_excel(url, sheet_name='Titanic5_all').convert_dtypes() #Wichtig um damit zu arbeiten
file = 'data/titanic.pickle' # Damit es local gespeichert wird
t.to_pickle(file)

In [13]:
file = 'data/titanic.pickle'
t = pd.read_pickle(file)
t.dtypes

Name_ID                 Int64
Name           string[python]
Female                  Int64
Male                    Int64
Sex            string[python]
Age                   Float64
Class/Dept     string[python]
Class                  object
Ticket                 object
Joined         string[python]
Occupation     string[python]
Boat [Body]            object
Price                  object
Job            string[python]
Survived                Int64
URL            string[python]
Last           string[python]
Title          string[python]
First          string[python]
DoB                    object
Year_Birth             object
Date_Death             object
DoB_Clean              object
Age_F_Code     string[python]
Age_F                 Float64
sibsp                   Int64
parch                   Int64
dtype: object

In [16]:
t.sample(3)

,Name_ID,Name,Female,Male,Sex,Age,Class/Dept,Class,Ticket,Joined,...,Title,First,DoB,Year_Birth,Date_Death,DoB_Clean,Age_F_Code,Age_F,sibsp,parch
1124,128,"BARLOW, Mr Charles",0,1,male,30.0,Engineering Crew,E,NaN,Southampton,...,Mr,Charles,NaN,NaN,1912-04-15 00:00:00,NaN,A,30.0,<NA>,<NA>
1933,109,"BAILEY, Mr George Frank",0,1,male,46.0,Engineering Crew,E,NaN,Southampton,...,Mr,George Frank,NaN,1866,1912-04-15 00:00:00,6/30/1866,M,45.0,<NA>,<NA>
647,29,"ALLEN, Mr Ernest Frederick",0,1,male,24.0,Engineering Crew,E,NaN,Southampton,...,Mr,Ernest Frederick,1888-02-10,NaN,1968-12-27 00:00:00,2/10/1888,C,24.0,<NA>,<NA>

In [18]:
t.columns

Index(['Name_ID', 'Name', 'Female', 'Male', 'Sex', 'Age', 'Class/Dept',
       'Class', 'Ticket', 'Joined', 'Occupation', 'Boat [Body]', 'Price',
       'Job', 'Survived', 'URL', 'Last', 'Title', 'First', 'DoB', 'Year_Birth',
       'Date_Death', 'DoB_Clean', 'Age_F_Code', 'Age_F', 'sibsp', 'parch'],
      dtype='object')

### Wertebereich

In [25]:
# set(t["Class"]) #Python Menge daraus machen
print(t["Class"].unique())
print(t["Joined"].unique())
print(t["Boat [Body]"].unique())
print(t["Boat [Body]"].unique())

[3 2 1 'V' 'R' 'E' 'D' 'B']
<StringArray>
['Southampton', 'Cherbourg', 'Queenstown', 'Belfast']
Length: 4, dtype: string
[10 '  ' 16 4 'C ' 11 13 ' [4]' 15 14 'D ' 2 5 3 ' [1]' ' [67]' 9 ' [259]'
 ' [190]' 12 ' [328]' 'B ' ' [311]' ' [186]' ' [83]' ' [244]' ' [238]' 6 8
 ' [314]' 7 ' [18]' ' [252]' ' [58]' ' [153]' ' [53]' 'A ' ' [101]'
 ' [127]' ' [9]' ' [195]' ' [294]' ' [273]' ' [204]' ' [2]' ' [27]'
 ' [323]' ' [181]' ' [89]' 1 ' [150]' ' [10]' ' [69]' ' [193]' ' [104]'
 ' [327]' ' [169]' ' [221]' ' [215]' ' [299]' ' [47]' ' [276]' ' [242]'
 ' [232]' ' [115]' ' [50]' ' [140]' ' [304]' ' [116]' ' [227]' ' [8]'
 ' [100]' ' [86]' ' [184]' ' [123]' ' [148]' ' [317]' ' [297]' ' [155]'
 ' [79]' ' [267]' ' [97]' ' [68]' ' [108]' ' [82]' ' [64]' ' [81]'
 ' [103]' ' [191]' ' [55]' ' [183]' ' [302]' ' [312]' ' [334]' ' [298]'
 ' [177]' ' [330]' ' [309]' ' [287]' ' [158]' ' [272]' ' [131]' ' [202]'
 ' [253]' ' [262]' ' [306]' ' [3]' ' [321]' ' [43]' ' [173]' ' [301]'
 ' [23]' ' [14]' ' [300]' ' [200]' ' [295]' ' [138]' ' [126]' ' [206]'
 ' [91]' ' [243]' ' [72]' ' [135]' ' [77]' ' [305]' ' [75]' ' [256]'
 ' [85]' ' [73]' ' [196]' ' [192]' ' [151]' ' [316]' ' [290]' ' [251]'
 ' [319]' ' [250]' ' [165]' ' [282]' ' [145]' ' [320]' ' [61]' ' [209]'
 ' [15]' ' [266]' ' [226]' ' [260]' ' [51]' ' [31]' ' [224]' ' [285]'
 ' [37]' ' [180]' ' [284]' ' [41]' ' [59]' ' [197]' ' [270]' ' [143]'
 ' [283]' ' [176]' ' [205]' ' [322]' ' [188]' ' [90]' ' [211]' ' [255]'
 ' [161]' 'A[331]' ' [172]' ' [17]' ' [111]' ' [212]' ' [189]' ' [231]'
 ' [107]' ' [313]' ' [98]' ' [168]' ' [157]' ' [246]' ' [293]' ' [247]'
 ' [236]' ' [49]' ' [147]' ' [152]' ' [277]' ' [329]' ' [315]' ' [218]'
 ' [133]' ' [66]' 'A[332]' ' [268]' ' [12]' ' [11]' ' [142]' ' [159]'
 ' [222]' ' [166]' ' [93]' ' [163]' ' [34]' ' [286]' ' [57]' ' [38]'
 ' [120]' ' [32]' ' [35]' ' [25]' ' [70]' ' [230]' ' [167]' ' [144]'
 ' [239]' ' [110]' ' [80]' ' [292]' ' [207]' ' [16]' ' [217]' ' [124]'
 ' [71]' ' [275]' ' [7]' ' [146]' ' [208]' ' [201]' ' [271]' ' [62]'
 ' [149]' ' [121]' ' [225]' ' [119]' ' [174]' ' [261]' ' [130]' ' [19]'
 ' [141]' ' [175]' ' [235]' ' [307]' ' [52]' ' [258]' ' [122]' ' [274]'
 ' [263]' ' [109]' ' [46]' ' [234]' ' [249]' ' [171]' ' [96]' ' [269]'
 ' [22]' ' [187]' ' [156]' ' [45]' ' [245]']

DatenqualitÃ¤t: Wieviele Passagiere und Crew sind es?

In [27]:
# Es mÃ¼ssten 2200 Personen laut Wikipedia sein.897 Crew
t.shape

(2208, 27)

Gruppen bilden

In [35]:
g = t.groupby(by=["Class", "Sex"])
g

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F5FBBAAFD0>

In [33]:
g.groups

{(1, 'female'): [21, 109, 144, 145, 168, 173, 199, 232, 243, 247, 248, 263, 276, 290, 298, 415, 430, 455, 477, 485, 502, 503, 539, 542, 543, 578, 581, 612, 632, 649, 673, 680, 693, 712, 734, 745, 779, 822, 835, 899, 902, 917, 985, 1045, 1078, 1127, 1135, 1189, 1208, 1222, 1230, 1245, 1274, 1275, 1282, 1290, 1375, 1394, 1397, 1403, 1404, 1428, 1474, 1476, 1478, 1482, 1483, 1502, 1517, 1533, 1534, 1537, 1546, 1581, 1603, 1666, 1678, 1684, 1686, 1692, 1700, 1713, 1721, 1724, 1725, 1726, 1747, 1755, 1766, 1784, 1815, 1817, 1862, 1867, 1874, 1879, 1892, 1902, 1913, 1921, ...], (1, 'male'): [10, 45, 65, 99, 111, 163, 195, 231, 274, 368, 465, 467, 541, 550, 582, 583, 653, 656, 702, 721, 722, 737, 759, 825, 890, 892, 894, 897, 910, 954, 963, 966, 1014, 1033, 1083, 1087, 1095, 1100, 1101, 1123, 1147, 1163, 1168, 1170, 1175, 1218, 1219, 1254, 1266, 1345, 1368, 1402, 1454, 1492, 1495, 1503, 1526, 1531, 1532, 1535, 1548, 1562, 1564, 1568, 1582, 1584, 1587, 1588, 1592, 1593, 1597, 1642, 1648, 1661, 1675, 1679, 1687, 1689, 1694, 1717, 1728, 1745, 1752, 1762, 1783, 1792, 1806, 1812, 1819, 1820, 1822, 1826, 1834, 1843, 1850, 1864, 1878, 1886, 1900, 1903, ...], (2, 'female'): [9, 16, 28, 37, 44, 54, 55, 63, 68, 75, 79, 104, 107, 110, 114, 126, 175, 179, 192, 203, 213, 224, 305, 329, 344, 379, 449, 454, 525, 585, 589, 590, 594, 666, 687, 692, 709, 731, 749, 796, 880, 882, 904, 949, 958, 967, 971, 974, 1005, 1027, 1071, 1094, 1111, 1118, 1136, 1137, 1144, 1186, 1190, 1216, 1237, 1270, 1334, 1399, 1413, 1429, 1430, 1440, 1466, 1470, 1518, 1522, 1524, 1530, 1577, 1612, 1614, 1636, 1722, 1743, 1744, 1774, 1796, 1827, 1905, 1907, 1920, 1944, 1945, 1983, 1989, 1990, 1997, 2062, 2082, 2091, 2098, 2109, 2120, 2156, ...], (2, 'male'): [3, 6, 8, 11, 17, 24, 33, 39, 42, 76, 119, 124, 146, 158, 184, 210, 212, 217, 218, 241, 265, 270, 295, 299, 302, 317, 319, 334, 340, 343, 398, 405, 408, 413, 419, 445, 458, 517, 540, 571, 591, 617, 623, 640, 642, 645, 674, 675, 683, 684, 707, 729, 735, 738, 742, 743, 750, 755, 767, 769, 774, 798, 799, 833, 841, 865, 869, 927, 930, 937, 942, 961, 1019, 1031, 1048, 1053, 1054, 1059, 1098, 1117, 1121, 1149, 1150, 1152, 1162, 1171, 1182, 1215, 1225, 1236, 1244, 1272, 1278, 1283, 1287, 1306, 1318, 1319, 1325, 1379, ...], (3, 'female'): [0, 5, 14, 15, 18, 20, 22, 23, 27, 30, 31, 32, 35, 38, 40, 41, 47, 48, 53, 57, 58, 59, 62, 66, 67, 69, 74, 77, 78, 82, 89, 90, 92, 94, 97, 98, 105, 115, 117, 120, 123, 128, 130, 132, 133, 134, 138, 142, 148, 154, 157, 159, 160, 171, 172, 180, 193, 197, 198, 200, 201, 206, 223, 225, 234, 236, 238, 240, 246, 250, 251, 258, 272, 275, 283, 294, 297, 327, 351, 352, 353, 370, 376, 378, 397, 407, 418, 424, 431, 437, 438, 444, 456, 478, 482, 483, 493, 498, 510, 511, ...], (3, 'male'): [1, 2, 4, 7, 12, 13, 19, 25, 26, 29, 34, 36, 43, 46, 49, 50, 51, 52, 56, 60, 61, 64, 70, 71, 72, 73, 80, 81, 83, 84, 85, 86, 87, 88, 91, 93, 95, 96, 100, 101, 102, 103, 106, 108, 112, 113, 116, 118, 122, 127, 129, 131, 135, 136, 137, 143, 147, 149, 150, 151, 152, 153, 155, 161, 162, 166, 167, 169, 176, 178, 181, 182, 187, 190, 191, 202, 205, 207, 214, 215, 220, 221, 226, 229, 235, 242, 244, 245, 254, 255, 257, 264, 266, 268, 269, 273, 277, 278, 279, 280, ...], ('B', 'male'): [328, 420, 599, 658, 973, 1346, 1355, 1381], ('D', 'male'): [249, 595, 635, 672, 698, 725, 756, 772, 773, 832, 849, 873, 877, 905, 907, 932, 934, 965, 976, 1001, 1012, 1049, 1068, 1070, 1084, 1172, 1200, 1214, 1227, 1239, 1258, 1307, 1323, 1339, 1352, 1371, 1383, 1398, 1407, 1451, 1462, 1510, 1560, 1606, 1608, 1653, 1688, 1695, 1710, 1731, 1734, 1753, 1794, 1804, 1809, 1810, 1823, 1841, 1854, 1861, 1939, 1971, 1973, 1991, 2126, 2127], ('E', 'male'): [216, 230, 233, 303, 313, 324, 325, 326, 341, 346, 356, 374, 377, 383, 393, 403, 404, 409, 410, 432, 436, 440, 452, 460, 464, 470, 475, 476, 484, 486, 489, 490, 494, 501, 505, 506, 508, 509, 515, 520, 529, 531, 533, 548, 553, 557, 572, 575, 576, 586, 592, 593, 598, 605, 611, 613, 618, 622, 626, 627, 628, 631, 644, 647, 651, 654, 655, 661, 667, 670, 671, 677, 681, 688, 705, 708, 716, 726, 727, 739, 740, 741, 748, 751, 752, 760, 776, 778, 783, 791, 797, 800, 801, 804, 807, 812, 814, 828, 836, 837, ...], ('R', 'female'): [361, 1210], ('R', 'male'): [165, 170, 185, 186, 188, 196, 211, 252, 267, 300, 318, 336, 337, 338, 362, 363, 372, 373, 388, 390, 447, 451, 462, 469, 474, 549, 551, 580, 610, 625, 637, 652, 676, 686, 711, 715, 717, 746, 777, 793, 810, 820, 827, 829, 885, 887, 888, 948, 962, 977, 1004, 1026, 1073, 1146, 1224, 1289, 1332, 1363, 1499, 1512, 1515, 1594, 1649, 1830, 1835, 2016, 2159], ('V', 'female'): [558, 685, 1011, 1032, 1191, 1353, 1364, 1369, 1453, 1516, 1707, 1756, 1760, 1764, 1793, 1800, 1891, 1901, 1912, 1914, 1977], ('V', 'male'): [121, 125, 139, 140, 141, 156, 164, 174, 177, 183, 189, 194, 204, 208, 209, 219, 222, 227, 228, 237, 239, 253, 256, 259, 260, 261, 262, 271, 281, 282, 287, 289, 307, 308, 311, 316, 321, 330, 331, 335, 342, 345, 347, 350, 354, 360, 364, 375, 382, 385, 391, 395, 396, 401, 416, 417, 421, 427, 428, 433, 450, 471, 480, 492, 495, 497, 499, 507, 512, 513, 516, 527, 545, 546, 547, 560, 573, 579, 587, 601, 603, 606, 619, 620, 621, 624, 629, 630, 636, 638, 643, 657, 664, 696, 700, 719, 720, 728, 730, 744, ...]}

In [34]:
g.groups.keys()

dict_keys([(1, 'female'), (1, 'male'), (2, 'female'), (2, 'male'), (3, 'female'), (3, 'male'), ('B', 'male'), ('D', 'male'), ('E', 'male'), ('R', 'female'), ('R', 'male'), ('V', 'female'), ('V', 'male')])

In [36]:
for (cl, sex), group in g:
    print(f'({cl}, {sex}):')
    print(group[["Name", "Ticket"]])

(1, female):
                                   Name  Ticket
21         ALLISON, Miss Helen Loraine   113781
109           CARTER, Miss Lucile Polk   113760
144           LINES, Miss Mary Conover    17592
145   MADILL, Miss Georgette Alexandra    24160
168                     DICK, Mrs Vera    17474
...                                 ...     ...
2129          STONE, Mrs Martha Evelyn   113572
2135           STRAUS, Mrs Rosalie Ida    17483
2138           COMPTON, Mrs Mary Eliza    17756
2139   CROSBY, Mrs Catherine Elizabeth     5735
2206           WILLARD, Miss Constance   113795

[144 rows x 2 columns]
(1, male):
                                         Name  Ticket
10             ALLISON, Master Hudson Trevor   113781
45                  DODGE, Master Washington    33638
65            SPEDDEN, Master Robert Douglas    16966
99        CARTER, Master William Thornton II   113760
111               RYERSON, Master John Borie    17608
...                                       ...     ...
2187               KEEPING, Mr Edwin Herbert   113503
2189                       KLABER, Mr Herman   113028
2200               SMITH, Mr Richard William   113056
2203                VAN DER HOEF, Mr Wyckoff   111240
2207  WILLIAMS, Mr Fletcher Fellowes Lambert   113510

[180 rows x 2 columns]
(2, female):
                                          Name  Ticket
9                    WEST, Miss Barbara Joyce    34651
16                       LAROCHE, Miss Louise     2123
28                    QUICK, Miss Phyllis May    26360
37    LAROCHE, Miss Simonne Marie Anne AndrÃ©e     2123
44                 BECKER, Miss Marion Louise   230136
...                                        ...     ...
2164                         COOK, Mrs Selena    14266
2167           DAVIS, Miss Mary Ann Charlotte   237668
2176                      GARSIDE, Miss Ethel   243880
2182       JACOBSOHN, Mrs Amy Frances Christy   243847
2202                  TROUT, Mrs Jessie Laird   240929

[106 rows x 2 columns]
(2, male):
                                         Name  Ticket
3     HÃ¤MÃ¤LÃ¤INEN, Master Viljo Unto Johannes   250649
6             RICHARDS, Master Sibley George    29106
8               CALDWELL, Master Alden Gates   248738
11                 BECKER, Master Richard F.   230136
17              MALLET, Master AndrÃ© Clement     2079
...                                       ...     ...
2166           DAVIES, Master John Morgan jr    33112
2168               DENBUOY, Mr Albert Joseph    31029
2177              GASKELL, Mr William Alfred   239865
2181             JACOBSOHN, Mr Sidney Samuel   243847
2193               MATTHEWS, Mr William John    28228

[170 rows x 2 columns]
(3, female):
                                         Name  Ticket
0     DEAN, Miss Elizabeth Gladys 'Millvina'     2315
5               BACLINI, Miss Helene Barbara     2666
14               JOHNSON, Miss Eleanor Ileen   347742
15               KLASÃ©N, Miss Gertrud Emilia   350405
18                         NAKID, Miss Maria     2653
...                                       ...     ...
2179             HARKNETT, Miss Alice Phoebe     6609
2186                     JOHNSTON, Mrs Eliza     6607
2191               MAHON, Miss Bridget Delia   330924
2194                  MURPHY, Miss Catherine   367230
2195        MUSLAMaNi, Mrs Fatimah Muhammad      2649

[216 rows x 2 columns]
(3, male):
                                         Name   Ticket
1     DANBOM, Master Gilbert Sigvard Emanuel    347080
2                       TANNuS, Master As'ad      2625
4              PEACOCK, Master Albert Edward   3101315
7                   AKS, Master Frank Philip    392091
12                 DEAN, Master Bertram Vere      2315
...                                       ...      ...
2198             RUSH, Mr Alfred George John     20589
2199                        RYAN, Mr Patrick    371110
2201                      SVENSSON, Mr Johan    347060
2204                  WAZLI, Mr Yousif Ahmed      2647
2205                 WIDEGREN, Mr Carl Peter    347064

[493 rows x 2 columns]
(B, male):
                                      Name  Ticket
328               BRICOUX, Mr Roger Marie   250654
420                     HUME, Mr John Law   250654
599           KRINS, Mr Georges Alexandre   250654
658   BRAILEY, Mr William Theodore Ronald   250654
973     CLARKE, Mr John Frederick Preston   250654
1346           TAYLOR, Mr Percy Cornelius   250654
1355             WOODWARD, Mr John Wesley   250654
1381            HARTLEY, Mr Wallace Henry   250654
(D, male):
                                        Name Ticket
249                     TERRELL, Mr Bertram     NaN
595                       JEWELL, Mr Archie     NaN
635                    TAMLYN, Mr Frederick     NaN
672                     FLEET, Mr Frederick     NaN
698                    MOODY, Mr James Paul     NaN
...                                      ...    ...
1971                   MCCARTHY, Mr William     NaN
1973     NICHOLS, Mr Alfred William Stanley     NaN
1991                   HUMPHREYS, Mr Sidney     NaN
2126  O'LOUGHLIN, Dr William Francis Norman     NaN
2127             SMITH, Captain Edward John     NaN

[66 rows x 2 columns]
(E, male):
                                         Name Ticket
216                 ERVINE, Mr Albert George     NaN
230                               LEE, Mr H.     NaN
233   MITCHELL, Mr Lorenzo (Lawrence) Horace     NaN
303                   PERRY, Mr Edgar Lionel     NaN
313         SHILLABEER, Mr Charles Frederick     NaN
...                                       ...    ...
2088                        COLEMAN, Mr John     NaN
2090                         JAGO, Mr Joseph     NaN
2107                  MAY, Mr Arthur William     NaN
2175               FOSTER, Mr Alfred Charles     NaN
2188                       KIRKHAM, Mr James     NaN

[325 rows x 2 columns]
(R, female):
                            Name Ticket
361   MARTIN, Miss Mabel Elvina     NaN
1210  BOWKER, Miss Ruth Harwood     NaN
(R, male):
                                          Name Ticket
165                      CROVELLA, Sig. Luigi     NaN
170              DONATI, Sig. Italo Francesco     NaN
185                PERACCHIO, Sig. Sebastiano     NaN
186                        PIATTI, Sig. Louis     NaN
188                    PRICE, Mr Ernest Cyril     NaN
...                                        ...    ...
1649                  JAILLET, Mr Henri Marie     NaN
1830  NANNINI, Sig. Francesco Luigi Arcangelo     NaN
1835                    SCAVINO, Sig. Candido     NaN
2016                      ROUSSEAU, Mr Pierre     NaN
2159               BOCHET, Mr Pierre Giuseppe     NaN

[67 rows x 2 columns]
(V, female):
                                  Name Ticket
558            SNAPE, Mrs Lucy Violet     NaN
685     JESSOP, Miss Violet Constance     NaN
1011             MARSDEN, Miss Evelyn     NaN
1032                 SLOAN, Miss Mary     NaN
1191       SLOCOMBE, Mrs Maude Louise     NaN
1353            WALSH, Miss Catherine     NaN
1364               BENNETT, Mrs Mabel     NaN
1369                CATON, Miss Annie     NaN
1453         PRICHARD, Mrs Alice Maud     NaN
1516       WALLIS, Mrs Catherine Jane     NaN
1707         MARTIN, Mrs Annie Martha     NaN
1756        LAVINGTON, Miss Elizabeth     NaN
1760             MCLAREN, Mrs Hypatia     NaN
1764              ROBINSON, Mrs Annie     NaN
1793      LEATHER, Mrs Elizabeth Mary     NaN
1800          ROBERTS, Mrs Mary Kezia     NaN
1891  SMITH, Miss Katherine Elizabeth     NaN
1901                  BLISS, Mrs Emma     NaN
1912      GOLD, Mrs Jane Kate Coulson     NaN
1914               GREGSON, Miss Mary     NaN
1977           STAP, Miss Sarah Agnes     NaN
(V, male):
                                  Name Ticket
121         WATSON, Mr William Albert     NaN
125                BARRATT, Mr Arthur     NaN
139         HARRIS, Mr Clifford Henry     NaN
140           HOARE, Mr Leonard James     NaN
141     HOPKINS, Mr Frederick William     NaN
...                                ...    ...
2071       BAXTER, Mr Thomas Ferguson     NaN
2076  JENNER, Mr Thomas Henry (Harry)     NaN
2077               LATIMER, Mr Andrew     NaN
2100            RULE, Mr Samuel James     NaN
2101          BOGIE, Mr Norman Leslie     NaN

[410 rows x 2 columns]

In [37]:
g.get_group((3, 'male'))

,Name_ID,Name,Female,Male,Sex,Age,Class/Dept,Class,Ticket,Joined,...,Title,First,DoB,Year_Birth,Date_Death,DoB_Clean,Age_F_Code,Age_F,sibsp,parch
1,498,"DANBOM, Master Gilbert Sigvard Emanuel",0,1,male,0.33,3rd Class Passenger,3,347080,Southampton,...,Master,Gilbert Sigvard Emanuel,1911-11-16 00:00:00,NaN,1912-04-15 00:00:00,1911-11-16 00:00:00,C,0.0,0,2
2,1961,"TANNuS, Master As'ad",0,1,male,0.42,3rd Class Passenger,3,2625,Cherbourg,...,Master,As'ad,1911-11-08 00:00:00,NaN,1931-06-12 00:00:00,1911-11-08 00:00:00,C,0.0,0,1
4,1551,"PEACOCK, Master Albert Edward",0,1,male,0.58,3rd Class Passenger,3,3101315,Southampton,...,Master,Albert Edward,1911-09-08 00:00:00,NaN,1912-04-15 00:00:00,1911-09-08 00:00:00,C,1.0,1,1
7,19,"AKS, Master Frank Philip",0,1,male,0.83,3rd Class Passenger,3,392091,Southampton,...,Master,Frank Philip,1911-06-07 00:00:00,NaN,1991-07-15 00:00:00,1911-06-07 00:00:00,C,1.0,0,1
12,530,"DEAN, Master Bertram Vere",0,1,male,1.0,3rd Class Passenger,3,2315,Southampton,...,Master,Bertram Vere,1910-05-21 00:00:00,NaN,1992-04-14 00:00:00,1910-05-21 00:00:00,C,1.0,1,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2198,1738,"RUSH, Mr Alfred George John",0,1,male,<NA>,3rd Class Passenger,3,20589,Southampton,...,Mr,Alfred George John,1895-04-14,NaN,1912-04-15 00:00:00,4/14/1895,C,17.0,0,0
2199,1742,"RYAN, Mr Patrick",0,1,male,<NA>,3rd Class Passenger,3,371110,Queenstown,...,Mr,Patrick,NaN,1882,1912-04-15 00:00:00,6/30/1882,M,29.0,0,0
2201,1950,"SVENSSON, Mr Johan",0,1,male,<NA>,3rd Class Passenger,3,347060,Southampton,...,Mr,Johan,1837-05-17,NaN,1912-04-15 00:00:00,5/17/1837,C,74.0,0,0
2204,2100,"WAZLI, Mr Yousif Ahmed",0,1,male,<NA>,3rd Class Passenger,3,2647,Cherbourg,...,Mr,Yousif Ahmed,NaN,1889,1912-04-15 00:00:00,6/30/1889,M,22.0,0,0
2205,2141,"WIDEGREN, Mr Carl Peter",0,1,male,<NA>,3rd Class Passenger,3,347064,Southampton,...,Mr,Carl Peter,1861-03-06,NaN,1912-04-15 00:00:00,3/6/1861,C,51.0,0,0

In [38]:
# Projektion innerhalb des Group-By Objekts: innerhalb jeder Gruppe wird projekziert
g[["Class", "Sex", "Name", "Ticket"]].head()

     Class     Sex                                     Name   Ticket
0        3  female  DEAN, Miss Elizabeth Gladys 'Millvina'      2315
1        3    male  DANBOM, Master Gilbert Sigvard Emanuel    347080
2        3    male                    TANNuS, Master As'ad      2625
3        2    male  HÃ¤MÃ¤LÃ¤INEN, Master Viljo Unto Johannes    250649
4        3    male           PEACOCK, Master Albert Edward   3101315
...    ...     ...                                      ...      ...
973      B    male       CLARKE, Mr John Frederick Preston    250654
1011     V  female                    MARSDEN, Miss Evelyn       NaN
1032     V  female                        SLOAN, Miss Mary       NaN
1191     V  female              SLOCOMBE, Mrs Maude Louise       NaN
1210     R  female               BOWKER, Miss Ruth Harwood       NaN

[62 rows x 4 columns]

### Aggregation auf den Gruppen bilden

In [40]:
g = t.groupby(by=["Class", "Sex"])

In [41]:
# Wieviel Personen je Gruppe?
g.size()

Class  Sex
1      female    144
       male      180
2      female    106
       male      170
3      female    216
       male      493
B      male        8
D      male       66
E      male      325
R      female      2
       male       67
V      female     21
       male      410
dtype: int64

In [44]:
# Wieviel not_Werte in der Spalte Age
g["Age"].count()

Class  Sex
1      female    143
       male      174
2      female     99
       male      162
3      female    207
       male      473
B      male        8
D      male       66
E      male      323
R      female      2
       male       66
V      female     21
       male      410
Name: Age, dtype: int64

In [46]:
t["Price"].unique()

array(['Â£20 11s 6d', 'Â£14 8s', 'Â£8 10s 4d', 'Â£14 10s', 'Â£13 15s 6d',
       'Â£19 5s 2d', 'Â£18 15s', 'Â£9 7s', 'Â£29', 'Â£27 15s', 'Â£151 16s',
       'Â£39', 'Â£46 18s', 'Â£11 2s 8d', 'Â£12 3s 8d', 'Â£41 11s 7d', 'Â£37 1d',
       'Â£15 14s 10d', 'Â£39 13s 9d', 'Â£16 14s', 'Â£31 5s 6d', 'Â£12 5s 9d',
       'Â£26', 'Â£21 1s 6d', 'Â£22 7s 2d', 'Â£29 2s 6d', 'Â£20 4s 3d',
       'Â£27 18s', 'Â£10 9s 3d', 'Â£23', 'Â£31 7s 9d', 'Â£15 18s', 'Â£25 9s 4d',
       'Â£81 17s 2d', 'Â£13 8s 4d', 'Â£22 6d', 'Â£15 4s 11d', 'Â£69 11s',
       'Â£12 9s 6d', 'Â£33', 'Â£134 10s', 'Â£34 7s 6d', 'Â£26 5s', 'Â£23 9s',
       'Â£32 10s', 'Â£20 10s 6d', 'Â£3 3s 5d', 'Â£4 3d', 'Â£24 3s', 'Â£120',
       'Â£18 15s 9d', 'Â£11 4s 10d', 'Â£15 15s', 'Â£19 10s', 'Â£262 7s 6d',
       'Â£20 5s', 'Â£30 1s 5d', 'Â£9 4s 6d', 'Â£65', 'Â£7 17s 1d', ' ',
       'Â£8 6s', 'Â£7 4s 7d', 'Â£11 10s', 'Â£7 4s 6d', 'Â£18', 'Â£14 9s 1d',
       'Â£7 13s', 'Â£7 15s', 'Â£16 2s', 'Â£9 10s', 'Â£7 15s 6d', 'Â£39 8s',
       'Â£211 6s 9d', 'Â£10 10s', 'Â£7 16s 7d', 'Â£9 4s 4d', 'Â£8 14s 3d',
       'Â£21 13s 7d', 'Â£7 18s 6d', 'Â£14 9s 2d', 'Â£7 17s 7d', 'Â£8 13s 3d',
       'Â£47 2s', 'Â£8 1s', 'Â£57', 'Â£7 17s 11d', 'Â£7 14s 8d', 'Â£57 19s 7d',
       'Â£7 2s 6d', 'Â£12', 'Â£8 7d', 'Â£7 11s 10d', 'Â£13', 'Â£110 17s 8d',
       'Â£17 16s', 'Â£247 10s 6d', 'Â£73 10s', 'Â£6 15s', 'Â£53 2s', 'Â£15 10s',
       'Â£7 14s 5d', 'Â£7 14s 7d', 'Â£6 9s 11d', 'Â£60', 'Â£79 13s',
       'Â£9 16s 10d', 'Â£7 11s', 'Â£91 1s 7d', 'Â£8 3s 2d', 'Â£10 3s 5d',
       'Â£263', 'Â£153 9s 3d', 'Â£9 16s 11d', 'Â£6 19s 4d', 'Â£86 10s',
       'Â£26 5s 8d', 'Â£36 15s', 'Â£7 5s', 0, 'Â£7 1s', 'Â£13 17s 3d',
       'Â£7 15s 17d', 'Â£55 8s 10d', 'Â£7 15s 11d', 'Â£8 8s 8d', 'Â£77 19s 2d',
       'Â£7 16s', 'Â£7 12s 7d', 'Â£21', 'Â£77 5s 9d', 'Â£61 7s 7d', 'Â£55',
       'Â£7 14s 6d', 'Â£7 5s 8d', 'Â£8 9s 2d', 'Â£13 18s', 'Â£49 10s',
       'Â£59 8s', 'Â£8 19s 3d', 'Â£31 10s', 'Â£7 10s 5d', 'Â£7 14s 9d',
       'Â£61 19s 7d', 'Â£93 10s', 'Â£66 12s', 'Â£108 18s', 'Â£135 12s 8d',
       'Â£9 16s 9d', 'Â£9', 'Â£7 17s 9d', 'Â£83 3s 2d', 'Â£79 4s', 'Â£63 7s 2d',
       'Â£13 15s 10d', 'Â£56 9s 11d', 'Â£113 5s 6d', 'Â£15 11d', 'Â£82 5s 4d',
       'Â£69 6s', 'Â£247 10s 5d', 'Â£27 14s 5d', 'Â£13 10s', 'Â£8 17s',
       'Â£15 17s', 'Â£7 2s 10d', 'Â£49 10s 1d', 'Â£23 5s', 'Â£9 6s 6d',
       'Â£12 17s 6d', 'Â£78 17s', 'Â£30', 'Â£82 3s 5d', 'Â£136 15s 7d',
       'Â£8 2s 9d', 'Â£30 10s', 'Â£52', 'Â£13 17s 2d', 'Â£76 14s 7d',
       'Â£6 19s 6d', 'Â£106 8s 6d', 'Â£7 6s 3d', 'Â£15 8d', 'Â£211 10s', 'Â£24',
       'Â£26 11s', 'Â£31', 'Â£27', 'Â£6 17s 2d', 'Â£22 10s 6d', 'Â£35 10s',
       'Â£211 60s 9d', 'Â£7 11d', 'Â£7 14s 10d', 'Â£8 2s 3d', 'Â£9 9s 8d',
       'Â£29 14s', 'Â£25 14s 10d', 'Â£7 17s 6d', 'Â£164 17s 4d', 'Â£10 14s 2d',
       'Â£15 11s', 'Â£45 10s', 'Â£6 8s 9d', 'Â£15 11s 7d', 'Â£57 15s',
       'Â£12 14s 9d', 'Â£12 7s', 'Â£8 13s 8d', 'Â£221 15s 7d', 'Â£56 18s 7d',
       'Â£100', 'Â£7 15s 8d', 'Â£50 9s 11d', 'Â£28 10s 9d', 'Â£76 5s 10d',
       'Â£8 6s 15d', 'Â£7 11s 7d', 'Â£7', 'Â£5', 'Â£6 19s', 'Â£12 5s 6d',
       'Â£8 13s 1d', 'Â£90', 'Â£39 12s', 'Â£8 13s 9d', 'Â£71 5s 8d',
       'Â£83 9s 6d', 'Â£512 6s 7d', 'Â£26 5s 9d', 'Â£75 4s 10d', 'Â£17 8s',
       'Â£31 13s 7d', 'Â£16', 'Â£40 2s 6d', 'Â£52 11s 1d', 'Â£25 11s 9d',
       'Â£42 8s', 'Â£9 11s 9d', 'Â£80 4d', 'Â£80', 'Â£15 1s', 'Â£50', 'Â£55 18s',
       'Â£9 9s 6d', 'Â£89 2s 1d', 'Â£51 17s 3d', 'Â£28 10s', 'Â£7 17s',
       'Â£14 2s 2d', 'Â£133 13s', 'Â£30 13s 11d', 'Â£8 8s 1d', 'Â£6 9s',
       'Â£146 10s 5d', 'Â£61 3s 6d', 'Â£79 4d', 'Â£25 18s 7d', 'Â£38 10s',
       'Â£15', 'Â£31 13s 8d', 'Â£7 1s 1d', 'Â£34 5d', 'Â£28 14s 3d',
       'Â£12 10s 6d', 'Â£27 8s 11d', 'Â£78 5s 4d', 'Â£51 9s 7d', 'Â£14',
       'Â£15 2s', 'Â£25 18s 6d', 'Â£6 4s 9d', 'Â£75 5s', 'Â£32 6s 5d',
       'Â£9 13s 9d', 'Â£71', 'Â£34 13s 1d', 'Â£10 10s 4d', 'Â£42 10s',
       'Â£12 13s', 'Â£33 10s', 'Â£35'], dtype=object)

In [48]:
# Umsatz je Gruppe in Pfund
g["Price"].sum() # Ohje ;) muss noch in eine Zahl gewandelt werden da Objekt

TypeError: can only concatenate str (not "int") to str

In [49]:
# Anzahl Ã¼berlebende
g["Survived"].sum()

Class  Sex
1      female    139
       male       62
2      female     94
       male       24
3      female    106
       male       75
B      male        0
D      male       43
E      male       72
R      female      2
       male        1
V      female     18
       male       76
Name: Survived, dtype: Int64

In [50]:
g["Age_F"].mean()

Class  Sex
1      female    36.888889
       male      40.877778
2      female    28.386792
       male      30.623529
3      female    23.149074
       male      25.688391
B      male         27.625
D      male      33.954545
E      male      30.732308
R      female         25.0
       male      25.328358
V      female    36.809524
       male      31.795122
Name: Age_F, dtype: Float64

Wenn ich Aggregationen auf einen df anwende(ohne Gruppen zu bilden)

In [52]:
(t["Survived"].sum(), t["Age_F"].mean().round(1))

(712, 30.1)

Nulls in den Gruppen

In [55]:
gn = t.groupby(["Job"], dropna=False).size() # Durch dropna= False bleiben die NA Werte erhalten
gn

Job
                        885
H&W Guarantee Group       9
Musician                  8
Postal Clerk              5
Servant                  43
Titanic Officers          8
<NA>                   1250
dtype: int64

In [56]:
t.describe()

,Name_ID,Female,Male,Age,Survived,Age_F,sibsp,parch
count,2208.0,2208.0,2208.0,2154.0,2208.0,2206.0,1309.0,1309.0
mean,1104.5,0.221467,0.778533,30.15877,0.322464,30.146963,0.498854,0.385027
std,637.539018,0.415328,0.415328,11.958248,0.467525,12.11454,1.041658,0.86556
min,1.0,0.0,0.0,0.17,0.0,0.0,0.0,0.0
25%,552.75,0.0,1.0,22.0,0.0,22.0,0.0,0.0
50%,1104.5,0.0,1.0,29.0,0.0,29.0,0.0,0.0
75%,1656.25,0.0,1.0,37.0,1.0,38.0,1.0,0.0
max,2208.0,1.0,1.0,71.0,1.0,74.0,8.0,9.0

In [58]:
g.describe()

             Name_ID                                                           \
               count         mean         std    min     25%     50%      75%
Class Sex
1     female   144.0   995.618056  654.161001   28.0  419.25   832.0   1591.0
      male     180.0  1104.116667  659.861525   35.0   500.0  1060.0  1723.75
2     female   106.0  1114.132075  663.583993    9.0  517.25  1057.5  1680.75
      male     170.0  1033.423529  593.667408    8.0   557.0   976.5   1500.5
3     female   216.0  1056.342593   605.19882    5.0   565.0  1120.0  1501.25
      male     493.0   1147.98783  630.295069    1.0   616.0  1176.0   1694.0
B     male       8.0       1001.5  742.579866  249.0  364.75   908.5   1341.0
D     male      66.0  1160.893939  584.645721   45.0   719.0  1220.5   1586.5
E     male     325.0  1103.704615  630.630744   11.0   565.0  1082.0   1637.0
R     female     2.0        753.0  728.319985  238.0   495.5   753.0   1010.5
      male      67.0  1178.746269  698.693116   27.0   529.5  1371.0   1742.0
V     female    21.0  1336.571429  605.618657  175.0  1012.0  1321.0   1865.0
      male     410.0  1114.226829  657.485028    2.0  533.75  1103.5  1691.75

                     Female       ... sibsp        parch                      \
                 max  count mean  ...   75%   max  count      mean       std
Class Sex                         ...
1     female  2198.0  144.0  1.0  ...   1.0   3.0  144.0  0.472222  0.774998
      male    2191.0  180.0  0.0  ...   1.0   3.0  180.0  0.277778  0.652075
2     female  2202.0  106.0  1.0  ...   1.0   3.0  106.0  0.650943  0.862361
      male    2156.0  170.0  0.0  ...   1.0   2.0  170.0  0.194118  0.490104
3     female  2196.0  216.0  1.0  ...   1.0   8.0  216.0  0.731481  1.262014
      male    2208.0  493.0  0.0  ...   0.0   8.0  493.0  0.255578  0.788377
B     male    2183.0    8.0  0.0  ...  <NA>  <NA>    0.0      <NA>      <NA>
D     male    2194.0   66.0  0.0  ...  <NA>  <NA>    0.0      <NA>      <NA>
E     male    2199.0  325.0  0.0  ...  <NA>  <NA>    0.0      <NA>      <NA>
R     female  1268.0    2.0  1.0  ...  <NA>  <NA>    0.0      <NA>      <NA>
      male    2206.0   67.0  0.0  ...  <NA>  <NA>    0.0      <NA>      <NA>
V     female  2077.0   21.0  1.0  ...  <NA>  <NA>    0.0      <NA>      <NA>
      male    2197.0  410.0  0.0  ...  <NA>  <NA>    0.0      <NA>      <NA>


               min   25%   50%   75%   max
Class Sex
1     female   0.0   0.0   0.0   1.0   4.0
      male     0.0   0.0   0.0   0.0   4.0
2     female   0.0   0.0   0.0   1.0   3.0
      male     0.0   0.0   0.0   0.0   2.0
3     female   0.0   0.0   0.0   1.0   9.0
      male     0.0   0.0   0.0   0.0   9.0
B     male    <NA>  <NA>  <NA>  <NA>  <NA>
D     male    <NA>  <NA>  <NA>  <NA>  <NA>
E     male    <NA>  <NA>  <NA>  <NA>  <NA>
R     female  <NA>  <NA>  <NA>  <NA>  <NA>
      male    <NA>  <NA>  <NA>  <NA>  <NA>
V     female  <NA>  <NA>  <NA>  <NA>  <NA>
      male    <NA>  <NA>  <NA>  <NA>  <NA>

[13 rows x 64 columns]

Finde Zeilen (innerhalb jeder Gruppe), die Min/Max-Wert fÃ¼r eine Spalte annehmen.

In [60]:
row = g["Age_F"].idxmin()
row
# t.loc[row]

Class  Sex
1      female     21
       male       10
2      female      9
       male        3
3      female      0
       male        1
B      male      328
D      male      249
E      male      216
R      female    361
       male      188
V      female    558
       male      121
Name: Age_F, dtype: int64

In [61]:
def gefalter(df):
    gesalter = df["Age_F"].sum()
    nof_kids = df["parch"].count()
    return gesalter/nof_kids

In [62]:
gefalter(t)

50.80534759358289

In [63]:
g.apply(gefalter)

C:\Users\Student\AppData\Local\Temp\ipykernel_7976\2795405722.py:4: RuntimeWarning: divide by zero encountered in scalar divide
  return gesalter/nof_kids

Class  Sex
1      female    36.888889
       male      40.877778
2      female    28.386792
       male      30.623529
3      female    23.149074
       male      25.584178
B      male            inf
D      male            inf
E      male            inf
R      female          inf
       male            inf
V      female          inf
       male            inf
dtype: float64